In [ ]:
Problem set 2

In [12]:
#Question One
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [13]:
b()

In [14]:
b()

In [15]:
b()

In [16]:
a

6

In [ ]:
# when global a=0, the function  c(a) which is to return a+2 will then be 0+2=2,
#for each b(), there will be additional 2 added to the output which then gives the final output as 6

In [ ]:
#Question 4
from tkinter import Tk, Label, RAISED
root = Tk()
labels = [['MC', 'M+', 'M-', 'MR'],

          ['C' , '\u221a', 'x\u00b2', '+' ],

          ['7' , '8' , '9' , '-' ],

          ['4' , '5' , '6' , '*' ],

          ['1' , '2' , '3' , '/' ],

          ['0' , '.' , '+-', '=' ]]

for r in range(6):
    for c in range(4):
        label = Label(root,
                      relief=RAISED,
                      padx=10,
                      text=labels[r] [c])
        label.grid(row=r, column =c)
root.mainloop()

In [ ]:
from tkinter import *
root = Tk()
a = Label(root, text= 'Loan Amount:')
a.grid(row = 1)

 b = Entry(root)

 b.grid (row=1, column = 1)



root.mainloop()

In [3]:
#Question 5
# Collatz  
 
def printCollatz(Q):
 # function stop when the sequence gets to number 1
    while Q != 1:
        print(Q, end = ' ')
 
        # If Q is odd
        if Q & 1:
            Q = 3 * Q + 1
 
        # If even
        else:
            Q = Q // 2
 
    # Print 1 at the end
    print(Q)
 
#Calling Collatz(1)  
printCollatz(1)
printCollatz(10)

1
10 5 16 8 4 2 1

In [ ]:
#Question 6
#Write a recursive method binary() that takes a non-negative
integer n and prints the binary representation of integer n.
>>> binary(0)
0
>>> binary(1)
1
>>> binary(3)
11
>>> binary(9)
1001

In [28]:
# Python program to convert non-negative integer to binary 
    
# Function to convert non-negative integer to Binary number 

def decimalToBinary(n):  
    return bin(n).replace("0b", "")  
    
# Driver code  
if __name__ == '__main__':  
    print(decimalToBinary(0))  
    print(decimalToBinary(1))  
    print(decimalToBinary(3)) 
    print(decimalToBinary(9))

0
1
11
1001

#Question 9

In [4]:
# start up SQL with the simple command
%load_ext sql

In [5]:
%sql sqlite://

In [6]:
%%sql
CREATE TABLE INDIANDATA(City varchar(50), Country varchar(50), Season varchar(50), Temperature, Rainfall);
INSERT INTO INDIANDATA VALUES('Mumbai','India','Winter', 24.8, 5.9);
INSERT INTO INDIANDATA VALUES('Mumbai','India','Spring', 28.4,16.2);
INSERT INTO INDIANDATA VALUES('Mumbai','India','Summer',27.9, 1549.4);
INSERT INTO INDIANDATA VALUES('Mumbai','India','Fall', 27.6, 346.0);
INSERT INTO INDIANDATA VALUES('London','United Kingdom','Winter', 4.2, 207.7);
INSERT INTO INDIANDATA VALUES('London','United Kingdom','Spring', 8.3, 169.6);
INSERT INTO INDIANDATA VALUES('London','United Kingdom','Summer', 15.7, 157.0);
INSERT INTO INDIANDATA VALUES('London','United Kingdom','Fall', 10.4, 218.5);
INSERT INTO INDIANDATA VALUES('Cario','Egypt','Winter', 13.6, 16.5);
INSERT INTO INDIANDATA VALUES('Cario','Egypt','Spring', 20.7, 6.5);
INSERT INTO INDIANDATA VALUES('Cario','Egypt','Summer', 27.7, 0.1);
INSERT INTO INDIANDATA VALUES('Cario','Egypt','Fall', 22.2, 4.5);

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [42]:
#lsit of Table
%sql SELECT * from INDIANDATA;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Winter', '4.2', '207.7'),
 ('London', 'United Kingdom', 'Spring', '8.3', '169.6'),
 ('London', 'United Kingdom', 'Summer', '15.7', '157.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cario', 'Egypt', 'Winter', '13.6', '16.5'),
 ('Cario', 'Egypt', 'Spring', '20.7', '6.5'),
 ('Cario', 'Egypt', 'Summer', '27.7', '0.1'),
 ('Cario', 'Egypt', 'Fall', '22.2', '4.5')]

In [46]:
%sql SELECT * from INDIANDATA WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0')]

In [47]:
#All the cities, but without repetition
%sql SELECT DISTINCT City from INDIANDATA

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cario',)]

In [49]:
#All the Fall records
%sql SELECT * from INDIANDATA WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cario', 'Egypt', 'Fall', '22.2', '4.5')]

In [9]:
#The city, country, and season for which the average rainfall is between 200 and 400 millimeters
%sql SELECT City, Country, Season from INDIANDATA WHERE Rainfall BETWEEN 200 AND 400

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [ ]:
%sql SELECT

In [23]:
#9f
%sql SELECT City, Country from INDIANDATA WHERE Season AND Temperature >= "20" ORDER BY Temperature

 * sqlite://
(sqlite3.OperationalError) no such column: Fall
[SQL: SELECT City, Country from INDIANDATA WHERE Season(Fall) AND Temperature >= 20 ORDER BY Temperature]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
%sql SELECT City, Country from INDIANDATA WHERE Season = "Fall" AND Temperature >= "20" ORDER BY Temperature

In [18]:
#9g
%sql SELECT SUM (Rainfall),City from INDIANDATA WHERE City ="Cairo"

 * sqlite://
(sqlite3.OperationalError) no such column: Cairo
[SQL: SELECT SUM (Rainfall),City from INDIANDATA WHERE City =Cairo]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [22]:
#9h
SELECT SUM (Rainfall),Season FROM INDIANDATA GROUP BY Season

SyntaxError: invalid syntax (<ipython-input-22-9c13d1fc6f89>, line 2)

In [ ]:
%sql SELECT SUM from INDIANDATA, 
SUM (advance_amount) 
FROM orders 
GROUP BY agent_code;

In [ ]:
#Question 10
#Question 10
. Suppose list words is defined as follows:
>>> words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
Write list comprehension expressions that use list words and generate the following
lists:
a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE',
'LAZY', 'DOG']

In [18]:
word=['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']
Caps = []

for the in word:
    Caps.append(the.upper())
    
print(Caps)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [20]:
word=['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']
Lower = []

for the in word:
    Lower.append(the.lower())
    
print(Lower)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [19]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

Length = []

for the in word:
    Length.append(len(the))
    
print(Length)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [24]:
 list(map(list, zip(Caps,Lower,Length)))

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3],
 ['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3],
 ['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [34]:
LengthFour = []

for the in word:
    if len(the)>=4:
     LengthFour.append(the)
    
print(LengthFour)

['quick', 'brown', 'jumps', 'over', 'lazy']